#ifndef DEFINE_H
#define DEFINE_H
//--------------------------------------------------------------------------
enum //возвращаемые коды ошибок
{
    // FILE_ERROR = 1;
    INIT_ERROR      = 1,
};
//--------------------------------------------------------------------------
enum Size
{
    TILE_SIZE         = 15,
    MAP_WIDTH         = 40,
    MAP_HEIGHT        = 40,
    WINDOW_WIDTH      = 640,
    WINDOW_HEIGHT     = 480,
};
//--------------------------------------------------------------------------
enum TargetMode
{
    NORMAL = 0,
    CENTER
};
//--------------------------------------------------------------------------
#endif //DEFINE_H